# RoofArea_HeatedProj

## Description
Returns the heated (interior) area projected on the ground plane of roofs or roof faces that meet the criteria.

```pascal
FUNCTION RoofArea_HeatedProj(c : CRITERIA): REAL;
```

```python
def vs.RoofArea_HeatedProj(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|   |

## Remarks
[[User:CBM-c-|_c_]] (2016.06.28): See remark on [[VS:RoofArea Heated]].

## See Also
* RoofArea Heated
* RoofArea Total
* RoofArea TotalProj

## Version
Availability: from Vectorworks 14.0

## Category
* Criteria